（1）ISA总线是工业标准总线，只能支持16位的I/O设备，数据传输率大约是16Mb/s，也称为AT标准。

（2）EISA总线。EISA是在ISA总线的基础上发展起来的32位总线。该总线定义32位地址线、32位数据线以及其他控制信号线、电源线、地线等共196个接点。总线传输速率达33Mb/s。

（3）PCI总线。PCI总线是目前微型机上广泛采用的内总线，采用并行传输方式。PCI总线有适于32位机的124个信号的标准和适于64位机的188个信号的标准。PCI总线的传输速率至少为133Mb/s，64位PCI总线的传输速率为266Mb/s。PCI总线的工作与CPU的工作是相互独立的，也就是说，PCI总线时钟与处理器时钟是独立的、非同步的。PCI总线上的设备是 即插即用的。接在PCI总线上的设备均可以提出总线请求，通过PCI管理器中的仲裁机构允许该设备成为主控设备，主控设备与从属设备间可以进行点对点的数据传输。PCI总线能够对所传输的地址和数据信号进行奇偶校验检测。

（4）PCI Express总线。PCI Express简称为PCI-E，采用点对点串行连接，每个设备都有自己的专用连接，不需要向整个总线请求带宽，而且可以把数据传输率提高到一个很高的频率。相对于传统PCI总线在单一时间周期内只能实现单向传输，PCI Express的半双工连接能提供更高的传输速率和质量。
PCI Express的接口根据总线位宽不同而有所差异，包括X1、X4、X8以及X16（X2模式将用于内部接口而非插槽模式），其中Xl的传输速度为250Mb/s，而X16就是等于16倍于X1的速度，即是4Gb/s。较短的PCI Express卡可以插入较长的PCI Express插槽中使用。PCI Express接口能够支持热拔插。同时，PCI Express总线支持双向传输模式，还可以运行全双工模式，它的双单工连接能提供更高的传输速率和质量，它们之间的差异与半双工和全双工类似。因此连接的每个装置都可以使用最大带宽。

（5）前端总线。微机系统中，前端总线（Front Side Bus，FSB）是将CPU连接到北桥芯片的总线。选购主板和CPU时，要注意两者的搭配问题，一般来说，如果CPU不超频，那么前端总线是由CPU决定的，如果主板不支持CPU所需要的前端总线，系统就无法工作。也就是说，需要主板和CPU都支持某个前端总线，系统才能工作。通常情况下，一个CPU默认的前 端总线是唯一的。北桥芯片负责联系内存、显卡等数据吞吐量最大的部件，并与南桥芯片连接。CPU通过前端总线（FSB）连接到北桥芯片，进而通过北桥芯片与内存、显卡交换数据。FSB是CPU和外界交换数据的最主要通道，因此FSB的数据传输能力对计算机整体性能作用很大，如果没足够快的FSB，再强的CPU也不能明显提高计算机整体速度。

（6）RS-232C。RS-232C是一条串行外总线，其主要特点是所需传输线比较少，最少只需三条线（一条发、一条收、一条地线）即可实现全双工通信。传送距离远，用电平传送为15m，电流环传送可达千米。有多种可供选择的传送速率。采用非归零码负逻辑工作， 电平 为逻辑1，而 电平 为逻辑0，具有较好的抗干扰性。

（7）SCSI总线。小型计算机系统接口（SCSI）是一条并行外总线，广泛用于连接软硬磁盘、光盘、扫描仪等。该接口总线早期是8位的，后来发展到16位。传输速率由SCSI-1的5Mb/s到16位的Ultra2 SCSI的80Mb/s。今天的传输速率已高达320Mb/s。该总线上最多可接63种外设，传输距离可达20m（差分传送）。

（8）SATA。SATA是Serial ATA的缩写，即串行ATA，它主要用作主板和大量存储设备（如硬盘及光盘驱动器）之间的数据传输之用。SATA总线使用嵌入式时钟信号，具备了更强的纠错能力，与以往相比其最大的区别在于能对传输指令（不仅仅是数据）进行检查，如果发现错误会自动校正，这在很大程度上提高了数据传输的可靠性。串行接口还具有结构简单、支持热插拔的优点。

（9）USB。通用串行总线（USB）当前风头正劲，近几年得到十分广泛的应用。USB由4条信号线组成，其中两条用于传送数据，另外两条传送+5V容量为500mA的电源。可以经过集线器（Hub）进行树状连接，最多可达5层。该总线上可接127个设备。USB 1.0有两种传送速率：低速为1.5Mb/s，高速为12Mb/s。USB2.0的传送速率为480Mb/s，USB总线最大的优 点还在于它支持即插即用，并支持热插拔。
（10）IEEE-1394。IEEE-1394是高速串行外总线，近几年得到广泛应用。IEEE-1394也支持外设热插拔，可为外设提供电源，省去了外设自带的电源，能连接多个不同设备，支持同步和异步数据传输。IEEE-1394由6条信号线组成，其中两条用于传送数据，两条传送控制信号，另外两条传送8~40V容量为1500mA的电源，IEEE-1394总线理论上可接63个设备OIEEE-1394的传送速率从400Mb/s、800Mb/s、1600Mb/s直到3.2Gb/s。

（11）IEEE-488总线。IEEE-488是并行总线接口标准。微计算机、数字电压表、数码显示器等设备及其他仪器仪表均可用IEEE-488总线连接装配，它按照位并行、字节串行双向异步方式传输信号，连接方式为总线方式，仪器设备不需中介单元直接并联于总线上。总线上最多可连接15台设备。最大传输距离为20m，信号传输速度一般为500Kb/s，最大传输速度为1Mb/s。